MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz8110ca9/thirdparty/pic32cz8110ca9/component/tcc.h
/* -------- TCC_SYNCBUSY : (TCC Offset: 0x08) ( R/ 32) Synchronization Busy -------- */
#define TCC_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (TCC_SYNCBUSY) Synchronization Busy  Reset Value */

#define TCC_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (TCC_SYNCBUSY) Swrst Busy Position */
#define TCC_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << TCC_SYNCBUSY_SWRST_Pos)            /* (TCC_SYNCBUSY) Swrst Busy Mask */
#define TCC_SYNCBUSY_SWRST(value)             (TCC_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << TCC_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_ENABLE_Pos               _UINT32_(1)                                          /* (TCC_SYNCBUSY) Enable Busy Position */
#define TCC_SYNCBUSY_ENABLE_Msk               (_UINT32_(0x1) << TCC_SYNCBUSY_ENABLE_Pos)           /* (TCC_SYNCBUSY) Enable Busy Mask */
#define TCC_SYNCBUSY_ENABLE(value)            (TCC_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << TCC_SYNCBUSY_ENABLE_Pos)) /* Assignment of value for ENABLE in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CTRLB_Pos                _UINT32_(2)                                          /* (TCC_SYNCBUSY) Ctrlb Busy Position */
#define TCC_SYNCBUSY_CTRLB_Msk                (_UINT32_(0x1) << TCC_SYNCBUSY_CTRLB_Pos)            /* (TCC_SYNCBUSY) Ctrlb Busy Mask */
#define TCC_SYNCBUSY_CTRLB(value)             (TCC_SYNCBUSY_CTRLB_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CTRLB_Pos)) /* Assignment of value for CTRLB in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_STATUS_Pos               _UINT32_(3)                                          /* (TCC_SYNCBUSY) Status Busy Position */
#define TCC_SYNCBUSY_STATUS_Msk               (_UINT32_(0x1) << TCC_SYNCBUSY_STATUS_Pos)           /* (TCC_SYNCBUSY) Status Busy Mask */
#define TCC_SYNCBUSY_STATUS(value)            (TCC_SYNCBUSY_STATUS_Msk & (_UINT32_(value) << TCC_SYNCBUSY_STATUS_Pos)) /* Assignment of value for STATUS in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_COUNT_Pos                _UINT32_(4)                                          /* (TCC_SYNCBUSY) Count Busy Position */
#define TCC_SYNCBUSY_COUNT_Msk                (_UINT32_(0x1) << TCC_SYNCBUSY_COUNT_Pos)            /* (TCC_SYNCBUSY) Count Busy Mask */
#define TCC_SYNCBUSY_COUNT(value)             (TCC_SYNCBUSY_COUNT_Msk & (_UINT32_(value) << TCC_SYNCBUSY_COUNT_Pos)) /* Assignment of value for COUNT in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PATT_Pos                 _UINT32_(5)                                          /* (TCC_SYNCBUSY) Pattern Busy Position */
#define TCC_SYNCBUSY_PATT_Msk                 (_UINT32_(0x1) << TCC_SYNCBUSY_PATT_Pos)             /* (TCC_SYNCBUSY) Pattern Busy Mask */
#define TCC_SYNCBUSY_PATT(value)              (TCC_SYNCBUSY_PATT_Msk & (_UINT32_(value) << TCC_SYNCBUSY_PATT_Pos)) /* Assignment of value for PATT in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_WAVE_Pos                 _UINT32_(6)                                          /* (TCC_SYNCBUSY) Wave Busy Position */
#define TCC_SYNCBUSY_WAVE_Msk                 (_UINT32_(0x1) << TCC_SYNCBUSY_WAVE_Pos)             /* (TCC_SYNCBUSY) Wave Busy Mask */
#define TCC_SYNCBUSY_WAVE(value)              (TCC_SYNCBUSY_WAVE_Msk & (_UINT32_(value) << TCC_SYNCBUSY_WAVE_Pos)) /* Assignment of value for WAVE in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PER_Pos                  _UINT32_(7)                                          /* (TCC_SYNCBUSY) Period Busy Position */
#define TCC_SYNCBUSY_PER_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_PER_Pos)              /* (TCC_SYNCBUSY) Period Busy Mask */
#define TCC_SYNCBUSY_PER(value)               (TCC_SYNCBUSY_PER_Msk & (_UINT32_(value) << TCC_SYNCBUSY_PER_Pos)) /* Assignment of value for PER in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC0_Pos                  _UINT32_(8)                                          /* (TCC_SYNCBUSY) Compare Channel 0 Busy Position */
#define TCC_SYNCBUSY_CC0_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC0_Pos)              /* (TCC_SYNCBUSY) Compare Channel 0 Busy Mask */
#define TCC_SYNCBUSY_CC0(value)               (TCC_SYNCBUSY_CC0_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC0_Pos)) /* Assignment of value for CC0 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC1_Pos                  _UINT32_(9)                                          /* (TCC_SYNCBUSY) Compare Channel 1 Busy Position */
#define TCC_SYNCBUSY_CC1_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC1_Pos)              /* (TCC_SYNCBUSY) Compare Channel 1 Busy Mask */
#define TCC_SYNCBUSY_CC1(value)               (TCC_SYNCBUSY_CC1_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC1_Pos)) /* Assignment of value for CC1 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC2_Pos                  _UINT32_(10)                                         /* (TCC_SYNCBUSY) Compare Channel 2 Busy Position */
#define TCC_SYNCBUSY_CC2_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC2_Pos)              /* (TCC_SYNCBUSY) Compare Channel 2 Busy Mask */
#define TCC_SYNCBUSY_CC2(value)               (TCC_SYNCBUSY_CC2_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC2_Pos)) /* Assignment of value for CC2 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC3_Pos                  _UINT32_(11)                                         /* (TCC_SYNCBUSY) Compare Channel 3 Busy Position */
#define TCC_SYNCBUSY_CC3_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC3_Pos)              /* (TCC_SYNCBUSY) Compare Channel 3 Busy Mask */
#define TCC_SYNCBUSY_CC3(value)               (TCC_SYNCBUSY_CC3_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC3_Pos)) /* Assignment of value for CC3 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC4_Pos                  _UINT32_(12)                                         /* (TCC_SYNCBUSY) Compare Channel 4 Busy Position */
#define TCC_SYNCBUSY_CC4_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC4_Pos)              /* (TCC_SYNCBUSY) Compare Channel 4 Busy Mask */
#define TCC_SYNCBUSY_CC4(value)               (TCC_SYNCBUSY_CC4_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC4_Pos)) /* Assignment of value for CC4 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC5_Pos                  _UINT32_(13)                                         /* (TCC_SYNCBUSY) Compare Channel 5 Busy Position */
#define TCC_SYNCBUSY_CC5_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC5_Pos)              /* (TCC_SYNCBUSY) Compare Channel 5 Busy Mask */
#define TCC_SYNCBUSY_CC5(value)               (TCC_SYNCBUSY_CC5_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC5_Pos)) /* Assignment of value for CC5 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC6_Pos                  _UINT32_(14)                                         /* (TCC_SYNCBUSY) Compare Channel 6 Busy Position */
#define TCC_SYNCBUSY_CC6_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC6_Pos)              /* (TCC_SYNCBUSY) Compare Channel 6 Busy Mask */
#define TCC_SYNCBUSY_CC6(value)               (TCC_SYNCBUSY_CC6_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC6_Pos)) /* Assignment of value for CC6 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC7_Pos                  _UINT32_(15)                                         /* (TCC_SYNCBUSY) Compare Channel 7 Busy Position */
#define TCC_SYNCBUSY_CC7_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC7_Pos)              /* (TCC_SYNCBUSY) Compare Channel 7 Busy Mask */
#define TCC_SYNCBUSY_CC7(value)               (TCC_SYNCBUSY_CC7_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC7_Pos)) /* Assignment of value for CC7 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_Msk                      _UINT32_(0x0000FFFF)                                 /* (TCC_SYNCBUSY) Register Mask  */

